![imagem%20unesp%20rosana.jpg](attachment:imagem%20unesp%20rosana.jpg)
# Groupby

O método groupby permite agrupar linhas de dados em conjunto e chamar funções agregadas

In [16]:
import pandas as pd
# Cria um DataFrame
data = {'Empresa':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Nome':['Joao Leme','Jeca','Felps','Joao Leme','P.A','Pedrao oreia'],
       'Venda':[300,120,340,124,243,200]}

In [17]:
df = pd.DataFrame(data)

In [18]:
df

  Empresa          Nome  Venda
0    GOOG     Joao Leme    300
1    GOOG          Jeca    120
2    MSFT         Felps    340
3    MSFT     Joao Leme    124
4      FB           P.A    243
5      FB  Pedrao oreia    200

** Agora, você pode usar o método .group by () para agrupar as linhas em conjunto com base em um nome de coluna. Por exemplo, vamos agrupar com base na empresa. Isso criará um objeto DataFrameGroupBy:**

In [5]:
df.groupby('Empresa')

Você pode salvar este objeto como uma nova variável:

In [4]:
por_companhia = df.groupby("Empresa")

E, em seguida, chamar métodos agregados do objeto:

In [5]:
por_companhia.mean()

         Venda
Empresa
FB       221.5
GOOG     210.0
MSFT     232.0

In [21]:
df.groupby(['Nome','Empresa']).std()

                      Venda
Nome         Empresa
Felps        MSFT       NaN
Jeca         GOOG       NaN
Joao Leme    GOOG       NaN
             MSFT       NaN
P.A          FB         NaN
Pedrao oreia FB         NaN

Mais exemplos de métodos agregados:

In [22]:
por_companhia.std()

              Venda
Empresa
FB        30.405592
GOOG     127.279221
MSFT     152.735065

In [23]:
por_companhia.min()

          Nome  Venda
Empresa
FB         P.A    200
GOOG      Jeca    120
MSFT     Felps    124

In [24]:
por_companhia.max()

                 Nome  Venda
Empresa
FB       Pedrao oreia    243
GOOG        Joao Leme    300
MSFT            Filho    340

In [25]:
por_companhia.count()

         Nome  Venda
Empresa
FB          2      2
GOOG        2      2
MSFT        2      2

In [22]:
por_companhia.describe()

        Venda
        count   mean         std    min     25%    50%     75%    max
Empresa
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [27]:
por_companhia.describe().T

Empresa              FB        GOOG        MSFT
Venda count    2.000000    2.000000    2.000000
      mean   221.500000  210.000000  232.000000
      std     30.405592  127.279221  152.735065
      min    200.000000  120.000000  124.000000
      25%    210.750000  165.000000  178.000000
      50%    221.500000  210.000000  232.000000
      75%    232.250000  255.000000  286.000000
      max    243.000000  300.000000  340.000000

In [33]:
por_companhia.describe().transpose()['GOOG']

Venda  count      2.000000
       mean     210.000000
       std      127.279221
       min      120.000000
       25%      165.000000
       50%      210.000000
       75%      255.000000
       max      300.000000
Name: GOOG, dtype: float64